# Пользователь вводит число n: размер квадратной матрицы.
# Затем пользователь вводит матрицу в формате n строк, в каждой из которых по n целых чисел.
# Примечание: Матрица в Python может быть представлена в виде list[list[int]].
# Программа вывести ответ на вопрос (Truе или False), является ли матрица магическим квадратом.
# Магический квадрат - это квадратная матрица, сумма элементов в столбцах,
# строках и на обеих диагоналях (главной и побочной) равны.
# Постарайтесь оформить программу в виде набора функций с понятными названиями и аннотациями.
# Примеры:
# 2
# 1 1
# 1 1
# True
#
# 2
# 1 2
# 2 1
# False
#
# 3
# 2 7 6
# 9 5 1
# 4 3 8
# True

