# Напишите функцию hello, которая принимает на вход строку (имя) и выводит на экран фразу "Hello {имя}".
# Вызовите написанную функцию.

def hello(name):
    print(f"Hello {name}")


hello('Nikita')