# Напишите функцию hello_world, которая печатает на экран приветствие "Hello world". Вызовите написанную функцию.

def hello_worl():
    print("Hello world")


hello_worl()