# Напишите функцию hello_world, которая возвращает строку "Hello world".
# Вызовите написанную функцию и выведите результат на экран.

def hello_world():
    return "Hello world"

print(hello_world())