# Напишите функцию hello, которая принимает на вход строку (имя) и возвращает строку "Hello {имя}".
# Вызовите написанную функцию и выведите результат на экран.

def hello(name):
    return f"Hello {name}"


print(hello('Nikita'))
