# Пользователь вводит произвольную строку. Выведите кортеж из уникальных символов введённой строки.

print(tuple(set(input('Введите произвольную строку: '))))
