# Сложение цифр целого числа
# Пользователь вводит целое трёхзначное число.
# Выведите сумму чисел числа.
# Например: 534 -> 5 + 3 + 4 = 12

number = input('Введите целое трёхзначное число: ')
print(int(number[0]) + int(number[1]) + int(number[2]))
